remote-home/testdata/goal_runs/20260709_230206_candidate_aiter_unified_no_output_scale_all3/bench.log
===== throughput: 4-8K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f66bec4ca60>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./4-8K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_230206_candidate_aiter_unified_no_output_scale_all3/results/4-8K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-34697817-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-09 23:02:32 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:22<00:00, 11.46s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [00:25<00:00,  8.40s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  25.21     
Total input tokens:                      19847     
Total generated tokens:                  241       
Request throughput (req/s):              0.12      
Output token throughput (tok/s):         9.56      
Peak output token throughput (tok/s):    15.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          796.80    
---------------Time to First Token----------------
Mean TTFT (ms):                          2724.54   
Median TTFT (ms):                        3167.32   
P50 TTFT (ms):                           3167.32   
P95 TTFT (ms):                           3185.45   
P99 TTFT (ms):                           3187.06   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          68.21     
Median TPOT (ms):                        68.29     
P50 TPOT (ms):                           68.29     
P95 TPOT (ms):                           68.36     
P99 TPOT (ms):                           68.36     
---------------Inter-token Latency----------------
Mean ITL (ms):                           67.35     
Median ITL (ms):                         68.28     
P50 ITL (ms):                            68.28     
P95 ITL (ms):                            68.95     
P99 ITL (ms):                            69.28     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          8135.28   
Median E2EL (ms):                        7937.53   
P50 E2EL (ms):                           7937.53   
P95 E2EL (ms):                           8997.18   
P99 E2EL (ms):                           9091.37   
==================================================
===== throughput: 8-16K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f4a6553ca60>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./8-16K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_230206_candidate_aiter_unified_no_output_scale_all3/results/8-16K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-15f3c1aa-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-09 23:03:48 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:28<00:00, 14.26s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [01:02<00:00, 20.86s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  62.59     
Total input tokens:                      38677     
Total generated tokens:                  610       
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         9.75      
Peak output token throughput (tok/s):    15.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          627.66    
---------------Time to First Token----------------
Mean TTFT (ms):                          6666.26   
Median TTFT (ms):                        7401.60   
P50 TTFT (ms):                           7401.60   
P95 TTFT (ms):                           7830.92   
P99 TTFT (ms):                           7869.08   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          68.82     
Median TPOT (ms):                        68.79     
P50 TPOT (ms):                           68.79     
P95 TPOT (ms):                           69.12     
P99 TPOT (ms):                           69.14     
---------------Inter-token Latency----------------
Mean ITL (ms):                           68.51     
Median ITL (ms):                         68.79     
P50 ITL (ms):                            68.79     
P95 ITL (ms):                            69.49     
P99 ITL (ms):                            70.02     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          20596.00  
Median E2EL (ms):                        14247.65  
P50 E2EL (ms):                           14247.65  
P95 E2EL (ms):                           36441.93  
P99 E2EL (ms):                           38414.75  
==================================================
===== throughput: 16-32K =====
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fb85577ca60>, trust_remote_code=False, seed=0, num_prompts=3, dataset_name='custom', no_stream=False, dataset_path='./16-32K_throughput.jsonl', no_oversample=True, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=True, custom_output_len=1024, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='Qwen3.5-27B', input_len=None, output_len=None, tokenizer='../Qwen3.5-27B', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=2, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/public/home/tangyu408/testdata/goal_runs/20260709_230206_candidate_aiter_unified_no_output_scale_all3/results/16-32K_throughput', result_filename='result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-e5399703-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body={'temperature': 0.0}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 07-09 23:05:47 [datasets.py:232] Skipping oversampling. Total samples: 3.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 2 requests...
100%|██████████| 2/2 [00:29<00:00, 15.00s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 3/3 [01:09<00:00, 23.00s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     3         
Failed requests:                         0         
Maximum request concurrency:             1         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  69.01     
Total input tokens:                      64238     
Total generated tokens:                  364       
Request throughput (req/s):              0.04      
Output token throughput (tok/s):         5.27      
Peak output token throughput (tok/s):    15.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          936.15    
---------------Time to First Token----------------
Mean TTFT (ms):                          14285.07  
Median TTFT (ms):                        14217.52  
P50 TTFT (ms):                           14217.52  
P95 TTFT (ms):                           15078.30  
P99 TTFT (ms):                           15154.81  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          69.99     
Median TPOT (ms):                        70.06     
P50 TPOT (ms):                           70.06     
P95 TPOT (ms):                           70.29     
P99 TPOT (ms):                           70.31     
---------------Inter-token Latency----------------
Mean ITL (ms):                           69.64     
Median ITL (ms):                         70.30     
P50 ITL (ms):                            70.30     
P95 ITL (ms):                            70.77     
P99 ITL (ms):                            71.49     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          22734.36  
Median E2EL (ms):                        19472.34  
P50 E2EL (ms):                           19472.34  
P95 E2EL (ms):                           32309.57  
P99 E2EL (ms):                           33450.65  
==================================================

===== result files =====
/public/home/tangyu408/testdata/goal_runs/20260709_230206_candidate_aiter_unified_no_output_scale_all3/results/4-8K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260709_230206_candidate_aiter_unified_no_output_scale_all3/results/8-16K_throughput/result.json
/public/home/tangyu408/testdata/goal_runs/20260709_230206_candidate_aiter_unified_no_output_scale_all3/results/16-32K_throughput/result.json